Repository: mlverse/torch
Catalog: po/*.po
Languages: fr

source: can only set to public, private and active
fr: ne peut être configuré qu’avec `public`, `private` ou `active

source: Because this function allows access to unexported functions, please use with caution, and only if you are sure know what you are doing. Unexported functions will expect inputs that are more C++-like than R-like. For example, they will expect all indexes to be 0-based instead of 1-based. In addition unexported functions may be subject to removal from the API without warning. Set quiet = TRUE to silence this warning.
fr: Comme cette fonction ouvre l’accès aux fonctions non-exportées, utilisez-là avec prudence, et seulement si vous êtes certains de ce que vous faites. Les fonctions non-exportées demande des entrées orientées C++ plus qu’orientées R. Par exemple, elle reposent sur l’indexation à 0 au lieu de l’indexation à 1. De plus, les fonctions non-exportées pourront être supprimées sans préavis. Configurez `quiet = TRUE` pour faire disparaitre ce message.

source: Only functions prefixed with 'torch_' are available from this function.
fr: Seules les fonctions préfixées par ‘torch_’ sont accessibles depuis cette fonction.

source: A function of name %s was not found. Please check your spelling and that the desired function exists.
fr: Impossible de trouver la fonction nommée %s . Veuillez vérifier l’orthographe et que la fonction désirée existe bien.

source: You should specify a single size argument.
fr: L’argument attendu ne doit comporter qu’une taille.

source: This function is deprecated in favor of torch_arange.
fr: Cette fonction est dépréciée et remplacée par ‘torch_arange’.

source: device must be an integer between 0 and the number of devices minus 1
fr: ‘device' doit être un entier entre 0 et le nombre d’éléments retranché de 1

source: type should not include an index because index was passed explicitly
fr: ‘type' ne doit pas contenir d’index, car l’index a été fourni de manière explicite

source: bit64 is required to correctly show the seed.
fr: ‘bit64' est nécessaire pour visualiser correctement la graine aléatoire.

source: Seed must an integer or integer64.
fr: ‘seed’ doit être de type ‘integer' ou ‘integer64’ .

source: Unexpected value
fr: Valeur inattendue

source: Torch is not installed, please run 'install_torch()'.
fr: ‘torch’ n’est pas installé, vous devez lancer ‘install_torch()’.

source: not implemented
fr: non implémenté

source: `x` must be a tensor.
fr: ‘X’ doit être un tensor.

source: Torch tensors do not have NAs!
fr: Les tenseurs torch n’ont pas de valeur NA!

source: Aborted.
fr: Abandonné.

source: currently unsuported
fr: non supporté pour le moment

source: argument 'out' must be a list of Tensors.
fr: l’argument ‘out’ doit être une liste de tenseurs.

source: expected tuple of
fr: un tuple de

source: elements but got
fr: éléments est attendu mais le tuple reçu en contient
