Repository: mlverse/torch
Catalog: po/R-*.po
Languages: fr

source: can only set to public, private and active
fr: ne peut être configuré qu’avec `public`, `private` ou `active`

source: Unsupported device {.val {device}}.
fr: Le périphérique {.val {device}} n'est pas un `device` valide.

source: {.var growth_factor} should be > 1 but got {.val {growth_factor}}.
fr: {.var growth_factor} doit être > 1. Ici, il est à {.val {growth_factor}}.

source: {.var backoff_factor} should be < 1 but got {.val {backoff_factor}}.
fr: {.var backoff_factor} doit être < 1. Ici, il est à {.val {backoff_factor}}.

source: {.var outputs} device must be {.val cuda}, got {.val {outputs$device$type}}.
fr: le périphérique {.var outputs} doit être {.val cuda}. Ici, il est à {.val {outputs$device$type}}.

source: {.var outputs} must be a tensor or a list of tensors, got {.cls {class(outputs)}}.
fr: {.var outputs} doit être un tenseur ou une liste de tenseurs. Ici, c'est un {.cls {class(outputs)}}.

source: {.fn unscale_} has already been called on this optimizer since the last {.fn update}.
fr: {.fn unscale_} a déjà été appelé sur cet optimiseur depuis le dernier {.fn update}.

source: {.fn unscale_} is being called after {.fn step}.
fr: {.fn unscale_} est appelé après {.fn step}, ce qui est invalide.

source: {.fn step} has already been called since the last {.fn update}.
fr: {.fn step} a déjà été appelé depuis le dernier {.fn update}.

source: {.var .growth_tracker} initialized before {.var .scale}
fr: {.var .growth_tracker} est initialisé avant {.var .scale} ce qui est invalide.

source: Attempted {.fn {funcname}} but {.var .scale} is {.val NULL}.
fr: Tentative d'appliquer {.fn {funcname}} mais {.var .scale} est {.val NULL}.

source: Attempted {.fn {funcname}} but {.var .growth_tracker} is {.val NULL}.
fr: Tentative d'appliquer {.fn {funcname}} mais {.var .growth_tracker} est {.val NULL}.

source: This mode should be enabled only for debugging as the different tests will slow down your program execution.
fr: Ce mode ne doit être activé qu'en cas de débogage. En effet, les différents tests vont ralentir l’exécution du programme.

source: `keep_graph` has been deprecated. Please use `retain_graph` instead.
fr: `keep_graph` est déprécié au profit de `retain_graph`.

source: `keep_graph` will take precedence.
fr: C'est `keep_graph` qui aura le dessus.

source: CuDNN is not available.
fr: CuDNN n'est pas disponible.

source: Because this function allows access to unexported functions, please use with caution, and only if you are sure know what you are doing. Unexported functions will expect inputs that are more C++-like than R-like. For example, they will expect all indexes to be 0-based instead of 1-based. In addition unexported functions may be subject to removal from the API without warning. Set quiet = TRUE to silence this warning.
fr: Comme cette fonction ouvre l’accès aux fonctions non-exportées, utilisez-là avec prudence, et seulement si vous êtes certains de ce que vous faites. Les fonctions non-exportées demandent des entrées de type C++ plutôt que de type R. Par exemple, elles reposent sur l’indexation à 0 au lieu de l’indexation à 1. De plus, les fonctions non-exportées pourront être supprimées sans préavis. Configurez `quiet = TRUE` pour faire disparaitre ce message.

source: Only functions prefixed with 'torch_' are available from this function.
fr: Seules les fonctions préfixées par ‘torch_’ sont accessibles depuis cette fonction.

source: A function of name %s was not found. Please check your spelling and that the desired function exists.
fr: Impossible de trouver la fonction nommée %s . Veuillez vérifier l’orthographe et que la fonction désirée existe bien.

source: Dimension is 1-based, but found 0.
fr: La dimension doit être indexée à 1. Elle est indexée à 0.

source: {fun_name} does not exist
fr: {fun_name} n'existe pas

source: not_implemented_error
fr: pas implémenté

source: deprecated
fr: déprécié

source: You should specify a single size argument.
fr: Vous ne devez utiliser qu'un seul argument.

source: This function is deprecated in favor of torch_arange.
fr: Cette fonction est dépréciée et remplacée par ‘torch_arange’.

source: values must be length 1
fr: les valeurs doivent être de longueur 1

source: value must be a length 1 vector
fr: la valeur doit être un vecteur de longueur 1

source: device must be an integer between 0 and the number of devices minus 1
fr: ‘device' doit être un entier entre 0 et le nombre de devices moins un

source: CUDA is not available.
fr: CUDA n'est pas disponible

source: type should not include an index because index was passed explicitly
fr: 'type' ne doit pas inclure d’index, car l’index a déjà été fourni de manière explicite

source: y is not a torch_device
fr: y n'est pas un device reconnu par torch

source: Either `probs` or `logits` must be specified, but not both.
fr: Vous pouvez configurer `probs` ou `logits` mais pas les deux.

source: `probs` must be at least one-dimensional.
fr: `probs` doit être au minimum à une dimension.

source: `logits` must be at least one-dimensional.
fr: `logits` doit être au minimum à une dimension.

source: Cannot determine validity of dependent constraint
fr: Impossible de déterminer la validité de la constante liée

source: Expected value$dim() >= {expected} but got {value$dim()}
fr: La valeur attendue est `value$dim() >= {expected}`. La valeur fournie est {value$dim()}

source: Mixture distribution must be distr_categorical.
fr: La distribution de mélange doit être de type `distr_categorial`.

source: Component distribution must be an instance of torch_Distribution.
fr: La distribution composante doit être une instance de `torch_Distribution`.

source: Mixture distribution component ({km}) does not equal component_distribution$batch_shape[-1] ({kc}).
fr: Les composantes de la loi de mélange ({km}) ne correspond pas à `component_distribution$batch_shape[-1]` ({kc}).

source: loc must be at least one-dimensional.
fr: `loc` doit être au minimum à une dimension.

source: Exactly one of covariance_matrix or precision_matrix or scale_tril may be specified.
fr: Vous ne pouvez pas spécifier plus d'un paramètre parmi `covariance_matrix`, `precision_matrix` et `scale_tril`.

source: scale_tril matrix must be at least two-dimensional
fr: la matrice `scale_tril` doit être au minimum de dimension 2

source: with optional leading batch dimensions
fr: préfixé de manière optionnelle par la taille du batch

source: covariance_matrix matrix must be at least two-dimensional
fr: `covariance_matrix` doit être au minimum de dimension 2

source: precision_matrix matrix must be at least two-dimensional
fr: `precision_matrix` doit être au minimum de dimension 2

source: Input arguments must all be instances of numeric,
fr: Tous les arguments en entrée doivent être soit des `numeric`,

source: torch_tensor or objects implementing __torch_function__.
fr: soit des `torch_tensor`, soit des objets implémentant une __`torch_function`__.

source: The value argument to log_prob must be a Tensor
fr: La valeur de `log_prob` doit être un Tenseur

source: The right-most size of value must match event_shape: {value$size()} vs {private$.event_shape}.
fr: La valeur la plus à droite ({value$size()}) doit être égale à `event_shape` ({private$.event_shape})

source: Value is not broadcastable with batch_shape+event_shape: {actual_shape} vs {expected_shape}.
fr: La valeur {actual_shape} n'est pas distribuable avec `batch_shape + event_shape = {expected_shape}`.

source: The value argument must be within the support
fr: Le paramêtre `value` doit être à l’intérieur du support

source: Subclass {paste0(class(self), collapse = ' ')} of
fr: La classe dérivée {paste0(class(self), collapse = ' ')} de

source: that defines a custom `initialize()` method
fr: qui définit une méthode spécifique pour `initialize()`

source: must also define a custom `expand()` method.
fr: doit aussi définir une méthode spécifique pour `expand()`.

source: One of the objects is not a dtype. Comparison is not possible.
fr: Un des objets n’est pas un dtype. La comparaison n’est pas possible.

source: bit64 is required to correctly show the seed.
fr: Le format ‘bit64’ est nécessaire pour visualiser correctement la graine aléatoire.

source: Seed must an integer or integer64.
fr: La graine aléatoire doit être de type ‘integer’ ou ‘integer64’.

source: Expected length {.var state} ({.val {length(state)}}) equal to the number of cuda devices ({.val {cuda_device_count()}}).
fr: La taille attendue pour {.var state} ({.val {length(state)}}) doit être le nombre de périphériques CUDA, soit ({.val {cuda_device_count()}}).

source: Installation failed.
fr: L'installation a échoué.

source: Could not install {.strong {libname}} from {.val {url}}.
fr: Impossible d'installer {.strong {libname}} depuis {.val {url}}.

source: Architecture {.val {arch}} is not supported in this OS.
fr: L'architecture {.val {arch} n'est pas disponible pour ce système d'exploitation.

source: Unsupported architecture {.val {arch}}.
fr: L'architecture {.val {arch}} n'est pas disponible.

source: Unsupported CUDA version {.val {version}}
fr: La version {.val {version}} n'est pas compatible.

source: Currently supported versions are: {.val {supported_versions}}.
fr: Les versions compatibles sont: {.val {supported_versions}}.

source: Unexpected value
fr: Valeur inattendue

source: Please use the env vars describe in {.fn install_torch} to configure the installation type.
fr: Merci d'utiliser les variables d'environnement comme expliqué dans {.fn install_torch} pour configurer le type d'installation.

source: It's not possible to configure the libtorch version.
fr: La version de libtorch n'est pas configurable.

source: This function is now deprecated. The same results can be achieved with {.fn install_torch}.
fr: Cette fonction est dépréciée. Vous obtenez les mêmes résultats en utilisant {.fn install_torch}.

source: Use the envvars {.envvar TORCH_URL} and {.envvar LANTERN_URL} to set the file locations.
fr: Utilisez les variables d'environnement {.envvar TORCH_URL} et {.envvar LANTERN_URL} pour configurer l'emplacement des fichiers.

source: Unable to download from {.url {url}}
fr: Impossible de télécharger depuis {.url {url}}

source: Please verify that the URL is not blocked by your firewall. See also {.url https://torch.mlverse.org/docs/articles/installation.html#file-based-download}
fr: Veuillez vérifier que l'URL n'est pas bloquée par votre Firewall. Voir aussi {.url https://torch.mlverse.org/docs/articles/installation.html#file-based-download}.

source: Argument 'x' must be a list.
fr: L’argument ‘x’ doit être une liste.

source: Argument 'x' must be scalar atomic.
fr: L’argument ‘x’ doit être un scalaire simple.

source: Torch is not installed, please run 'install_torch()'.
fr: Torch n’est pas installé, merci de lancer ‘install_torch()’.

source: `tol` argument is deprecated in favor of `atol` and `rtol`.
fr: Le paramètre `tol` est déprécié. Il faut maintenant utiliser `atol` et `rtol`.

source: `rcond` is deprecated in favor of `rtol`.
fr: Le paramètre`rcond` est déprécié. Il faut maintenant utiliser `rtol`.

source: embed_dim must be divisible by num_heads
fr: ‘embed_dim’ doit être divisible par ‘num_heads’

source: not implemented
fr: pas implémenté

source: expected 2D or 3D input (got {input$dim()}D input)
fr: tenseur d’entrée attendu en 2D ou 3D (tenseur {input$dim()}D reçu)

source: expected 4D input (got {input$dim()}D input)
fr: le tenseur d’entrée est attendu en 4D (tenseur {input$dim()}D reçu)

source: expected 5D input (got {input$dim()}D input)
fr: le tenseur d’entrée est attendu en 5D (tenseur {input$dim()}D reçu)

source: `in_channels` must be divisible by groups
fr: ‘in_channels’ doit être divisible par ‘groups’

source: `out_channels` must be divisible by groups
fr: ‘out_channels’ doit être divisible par ‘groups’

source: padding_mode must be one of [{paste(valid_padding_modes, collapse = ', ')}],
fr: ‘padding_mode’ doit être pris parmi [{paste(valid_padding_modes, collapse = ', ')}],

source: but got padding_mode='{padding_mode}'.
fr: actuellement ‘padding_mode={padding_mode}’.

source: Only `zeros` padding is supported.
fr: Le remplissage ne peut se faire qu’avec des zéros.

source: output_size must have {k} or {k+2} elements (got {length(output_size)})
fr: ‘output_size’ doit avoir soit {k} soit {k+2} éléments (actuellement {length(output_size)} éléments)

source: requested an output of size {output_size}, but valid
fr: la taille de sortie demandée est {output_size} alors que les tailles valides

source: sizes range from {min_size} to {max_size} (for an input
fr: doivent être dans la plage de {min_size} à {max_size} (pour un tenseur d’entrée

source: of size {input$size()[-c(1,2)]}
fr: de taille {input$size()[-c(1,2)]})

source: Only `zeros` padding mode is supported for ConvTranspose1d
fr: Seul le remplissage avec des zéros est disponible pour ‘ConvTranspose1d’

source: Only `zeros` padding mode is supported for ConvTranspose2d
fr: Seul le remplissage avec des zéros est disponible pour ‘ConvTranspose2d’

source: Only `zeros` padding mode is supported for ConvTranspose3d
fr: Seul le remplissage avec des zéros est disponible pour ‘ConvTranspose3d’

source: dropout probability has to be between 0 and 1 but got {p}
fr: la probabilité de ‘dropout’ doit être entre 0 et 1 (actuellement {p})

source: mean is more than 2 std from [a, b] in nn.init.trunc_normal_.
fr: La moyenne dépasse le double de l'écart-type sur [a, b] dans `nn.init.trunc_normal_`.

source: The distribution of values may be incorrect.
fr: La distribution des valeurs pourrait être incorrecte.

source: Unsupported nonlinearity: {nonlinearity}
fr: Non-linearité inconnue : {nonlinearity}

source: only p == 1 or p == 2 are supported.
fr: ‘p’ doit être soit 1 soit 2.

source: weight must be NULL or 1-dimensional
fr: ‘weight’ doit être NULL ou à une dimension

source: both output_size and output_ratio are NULL
fr: les deux valeurs ‘output_size’ et ‘output_ratio’ sont à NULL

source: both output_size and output_ratio are not NULL
fr: les deux valeurs ‘output_size’ et ‘output_ratio’ sont non NULL

source: output_ratio must be between 0 and 1.
fr: ‘output_ratio’ doit être entre 0 et 1.

source: dropout option adds dropout after all but last
fr: l'option `dropout` va ajouter du dropout à toutes les couches récurrentes sauf

source: recurrent layer, so non-zero dropout expects
fr: la dernière, donc un dropout non-null s'applique pour

source: num_layers greater than 1, but got dropout={dropout} and
fr: au moins deux couches. Il y a actuellement `dropout={dropout}` et

source: Unrecognized RNN mode: {mode}
fr: Le mode du RNN {mode} est inconnu

source: No cudnn backend for mode '{mode}'
fr: Pas de support matériel de cudnn pour le mode '{mode}'

source: Unknown nonlinearity '{self$nonlinearity}'
fr: Non-linearité inconnue : '{self$nonlinearity}'

source: `padding_idx` must be within num_embeddings
fr: ‘padding_idx’ doit être inclus dans les valeurs de ‘num_embeddings’

source: Shape of `.weight` does not match num_embeddings and embedding_dim
fr: La forme du tenseur ‘.weight’ ne correspond pas avec ‘num_embedding’ et ‘embedding_dim’

source: Input dimension should be at least {length(out_size) + 1}.
fr: Les dimensions de l’entrée devraient être au moins de {length(out_size) + 1}.

source: Forward method is not implemented
fr: la méthode 'forward' n'est pas implémentée.

source: nn.Module.to only accepts floating point ' 'dtypes, but got desired dtype {dtype}
fr: nn.Module.to n’accepte que des tenseurs de `dtypes float`, le type actuel est {dtype}.

source: Could not find {key} in the state_dict.
fr: Impossible de trouver {key} dans ‘state_dict’.

source: It's not possible to modify the parameters list.
fr: La liste des paramètres n’est pas modifiable.

source: You can modify the parameter in-place or use
fr: Vous pouvez modifier le paramètre à la volée ou bien utiliser

source: It's not possible to modify the buffers list.
fr: La liste des tampons n’est pas modifiable.

source: It's not possible to modify the modules list.
fr: La liste des modules n’est pas modifiable.

source: You can modify the modules in-place
fr: Vous pouvez modifier les modules à la volée ou bien utiliser

source: It's not possible to modify the children list.
fr: La liste des enfants n’est pas modifiable.

source: `x` must be a tensor.
fr: ‘X’ doit être un tensor.

source: All elements in {.arg dict} must be named.
fr: Les éléments de {.arg dict} doivent tous être nommés.

source: {.fn nn_module_dict} has {.fn forward} implementation.
fr: {.fn nn_module_dict} dispose d'une implémentation de {.fn forward}

source: not yet implemented
fr: pas implémenté

source: not yet implemented.
fr: pas encore implémenté.

source: Input should be a tensor and got '{class(input)}.
fr: L’entrée doit être un tenseur. Actuellement c’est un ‘{class(input)}’.

source: dropout2d: Received a {inp_dim}-D input to dropout2d, which is deprecated
fr: dropout2d: Une entrée {inp_dim}D pour `dropout2d` est dépréciée

source: and will result in an error in a future release. To retain the behavior
fr: et conduira prochainement à une erreur. Pour conserver le comportement

source: and silence this warning, please use dropout instead. Note that dropout2d
fr: et faire taire ce message, veuillez utiliser `dropout`. `dropout2d`

source: exists to provide channel-wise dropout on inputs with 2 spatial dimensions,
fr: n'existe que pour fournir du dropout sur la dimension couleur d'entrées à deux dimensions spatiales,

source: a channel dimension, and an optional batch dimension (i.e. 3D or 4D inputs).
fr: une dimension couleur, et eventullement une dimension pour le batch, soit des tenseurs 3D ou 4D.

source: dropout2d: Received a 3D input to dropout2d and assuming that channel-wise
fr: dropout2d: Une entrée 3D pour `dropout2d` sous-entend qu'un dropout uniquement sur la

source: 1D dropout behavior is desired - input is interpreted as shape (N, C, L), where C
fr: dimension couleur est attendu. L'entrée est interpretée de forme (N, L, C) avec C

source: is the channel dim. This behavior will change in a future release to interpret the
fr: la dimension Couleur. Ce comportement va changer dans les prochaines versions pour considérer

source: input as one without a batch dimension, i.e. shape (C, H, W). To maintain the 1D
fr: l'entrée comme étant sans dimension N pour le Batch. Pour conserver le fonctionnement 1D

source: channel-wise dropout behavior, please switch to using dropout1d instead.
fr: du dropout sur la Couleur, vous devez utiliser `dropout1d`.

source: if input is 2D, then offsets has to be NULL
fr: pour une entrée en 2D, les offsets doivent être NULL

source: reduction: 'mean' divides the total loss by both the batch size and the support size.
fr: La réduction `mean` divise la loss totale par `batch_size` et par `support_size`.

source: 'batchmean' divides only by the batch size, and aligns with the KL div math definition.
fr: `batchmean` divise la loss seulement par la `batch_size` et correspond avec la definition mathématique de la divergence de KL.

source: 'mean' will be changed to behave the same as 'batchmean' in the next major release.
fr: Le fonctionnement de `mean` suivra celui de `batchmean` dans la prochaine version majeure.

source: Using a target size {target_shape} that is different to the input size {input_shape}.
fr: La taille cible {target_shape} est différente de taille de l'entrée {input_shape}.

source: This will likely lead to incorrect results due to broadcasting.
fr: Cela risque de conduire à des résultats erronés du fait du broadcasting.

source: Please ensure they have the same size.
fr: Assurez-vous qu'ils soient de même taille.

source: reduction is not valid.
fr: la réduction n’est pas valide.

source: output_size should be a sequence containing
fr: ‘output_size’ doit être une séquence de

source: {length(kernel_size)} or {length(kernel_size) + 2} elements
fr: {length(kernel_size)} ou {length(kernel_size) + 2} éléments,

source: but it has a length of '{length(output_size)}'
fr: mais sa longueur actuelle est '{length(output_size)}'

source: output_ratio should not be NULL if output_size is NULL
fr: ‘output_ratio’ ne doit pas être NULL quand ‘output_size’ est NULL

source: only one of size or scale_factor should be defined
fr: ‘size’ et ‘scale_factor’ ne peuvent pas être définis simultanément

source: size shape must match input shape. Input is {dim}D, size is {length(size)}
fr: la forme de ‘size’ doit correspondre avec la forme de l’entrée. L’entrée est en {dim}D, la taille est {length(size)}

source: scale_factor shape must match input shape. Input is {dim}D, size is {length(size)}
fr: La forme de ‘scale_factor’ doit correspondre avec la forme de l’entrée. L’entrée est en {dim}D, la taille est {length(size)}.

source: either size or scale_factor should be defined
fr: vous devez définir soit ‘size’ soit ‘scale_factor’

source: Got 3D input, but bilinear mode needs 4D input
fr: L'entrée est en 3D, alors que le mode bilinéaire réclame du 4D.

source: Got 3D input, but trilinear mode needs 5D input
fr: L'entrée est en 3D, alors que le mode trilinéaire réclame du 5D.

source: Got 4D input, but trilinear mode needs 3D input
fr: L'entrée est en 4D, alors que le mode trilinéaire réclame du 3D.

source: Got 4D input, but trilinear mode needs 5D input
fr: L'entrée est en 4D, alors que le mode trilinéaire réclame du 5D.

source: Got 5D input, but trilinear mode needs 3D input
fr: L'entrée est en 5D, alors que le mode trilinéaire réclame du 3D.

source: Got 5D input, but bilinear mode needs 4D input
fr: L'entrée est en 5D, alors que le mode bilinéaire réclame du 4D.

source: Input Error: Only 3D, 4D and 5D input Tensors supported
fr: Erreur d'entrée: Seuls les tenseurs 3D, 4D, et 5D sont supportés en entrée

source: (got {input$dim()}D) for the modes: nearest | linear | bilinear | bicubic | trilinear
fr: (actuellement {input$dim()}D) pour les modes 'nearest | linear | bilinear | bicubic | trilinear'

source: (got {mode})
fr: (actuellement {mode})

source: Unknown mode name '{mode}'. Supported modes are 'bilinear'
fr: Le mode {mode} est inconnu. Les modes disponibles sont ‘bilinear’

source: and 'nearest'.
fr: et ‘nearest’.

source: Unknown padding mode name '{padding_mode}'. Supported modes are
fr: Mode de remplissage inconnu '{padding_mode}. Les modes disponibles sont

source: 'zeros', 'border' and 'reflection'.
fr: ‘zeros’, ‘border’ et ‘reflection’.

source: Torch tensors do not have NAs!
fr: Les tenseurs torch n’ont pas de valeur NA!

source: Invalid learning rate: {lr}
fr: ‘learning_rate’ invalide: {lr}

source: Invalid rho value: {rho}
fr: Valeur de ‘rho’ invalide: {rho}

source: Invalid epsilon value: {eps}
fr: Valeur de ‘epsilon’ invalide: {eps}

source: Invalid weight_decay value: {weight_decay}
fr: Valeur de ‘weight_decay’ invalide: {weight_decay}

source: Invalid lr_decay value: {lr_decay}
fr: Valeur de ‘lr_decay’ invalide: {lr_decay}

source: Invalid initial_accumulator_value value: {initial_accumulator_value}
fr: Valeur de ‘initial_accumulator_value’ invalide: {initial_accumulator_value}

source: Invalid eps: {eps}
fr: Valeur de ‘ops’ invalide: {eps}

source: Invalid beta parameter at index 1
fr: Paramètre ‘beta’ invalide à l’index 1

source: Invalid beta parameter at index 2
fr: Paramètre ‘beta’ invalide à l’index 2

source: Invalid weight decay value: {weight_decay}
fr: Valeur de ‘weight decay’ invalide: {weight_decay}

source: Invalid betas[1] parameter value: {beta[1]}
fr: Le paramètre `betas[1]` a une valeur invalide: {beta[1]}

source: Invalid betas[2] parameter value: {beta[2]}
fr: Le paramètre `betas[2]` a une valeur invalide: {beta[2]}

source: LBFGS doesn't support per-parameter options
fr: LBFGS ne permet pas les options pour chaque paramètre

source: only strong_wolfe is supported
fr: seul ’strong_wolfe’ est disponible
