Repository: mlverse/torch
Catalog: po/R-*.po
Languages: fr

source: not an optimizer
fr: n'est pas un optimiseur

source: param 'inital_lr' is not specified.
fr: Le paramêtre ‘initial_lr ’ n’est pas fourni.

source: lr_lambda length ({i}) is different from the number of
fr: la longueur de ‘lr_lambda’ ({i}) diffère du nombre de

source: You must define either total_steps OR (epochs AND steps_per_epoch)
fr: Il faut définir soit ‘total_steps’, soit ensemble’ epoch’ et ‘steps_per_epoch’

source: Expected positive integer total_steps, but got {total_steps}
fr: ‘total_steps’ doit être un entier positif, actuellement c’est {total_steps}

source: Expected positive integer epochs, but got {epochs}
fr: ‘epochs’ doit être un entier positif, actuellement c’est {epochs}

source: Expected positive integer steps_per_epoch, but got {steps_per_epoch}
fr: ‘steps_per_epoch’ doit être un entier positif, actuellement c’est {steps_per_epoch}

source: Expected float between 0 and 1 pct_start, but got {pct_start}
fr: La valeur doit être une valeur flottante entre 0 et 1, actuellement c’est {pct_start}

source: anneal_strategy must by one of 'cos' or 'linear', instead got {anneal_strategy}
fr: ‘anneal_strategy’ doit être soit ‘cos’ soit ‘linear’, actuellement c’est {anneal_strategy}

source: optimizer must support momentum with `cycle momentum` enabled
fr: L’optimiseur doit supporter un momentum incluant ‘cycle momentum’ activé

source: expected {length(optimizer$param_groups)} values for {name}
fr: la valeur {length(optimizer$param_groups)} est attendue pour la variable {name},

source: but got {length(param)}
fr: actuellement {length(param)}

source: Tried to step {step_num+1} times. The specified number of total steps is {self$total_steps}
fr: Tentative de répétition des `step` {step_num+1} fois. Le nombre de `step` spécifié est {self$total_steps}

source: Factor should be < 1.0
fr: Le `factor` doit être < 1.0

source: expected {length(optimizer$param_groups} min_lrs, got {length(min_lr)}
fr: {length(optimizer$param_groups} attendu pour `min_lrs`, actuellement c'est {length(min_lr)}

source: mode {mode} is unknown!
fr: le mode {mode} est inconnu!

source: threshold mode {threshold_mode} is unknown!
fr: le mode de ’threshod’ {threshold_mode} est inconnu!

source: Invalid momentum value: {momentum}
fr: Valeur de momentum invalide: {momentum}

source: Invalid alpha value: {alpha}
fr: Valeur de alpha invalide: {alpha}

source: Invalid eta values: {etas[[1]]}, {etas[[2]]}
fr: Valeurs de ‘eta’ invalides: {etas[[1]]}, {etas[[2]]}

source: Nesterov momentum requires a momentum and zero dampening
fr: Le Nesterov momentum a besoin d’un momentum et de ‘zero dampening’

source: Wrong parameters specification.
fr: Spécification des paramètres erronée.

source: `param_group` is not named
fr: le groupe de paramètres n’est pas nommé

source: optimizer can only optimize Tensors,
fr: l’optimiseur ne peut optimiser que des tenseurs,

source: but one of the params is {class(param)}
fr: mais un des paramètres est {class(param)}

source: can't optimize a non-leaf Tensor
fr: Impossible d’optimiser un tenseur non-feuille

source: parameter group didn't specify a value of required
fr: Il manque une valeur au groupe de paramètres

source: optimization parameter {nm}
fr: pour le paramètre d’optimisation {nm}

source: Loaded state dict has a different number of parameter groups
fr: Le dictionnaire d’état chargé en mémoire a un nombre de groupes de paramètres different

source: Loaded state dict has contains a parameter group that doesn't match the size of optimizers group.
fr: Le dictionnaire d’état chargé en mémoire contient un groupes de paramètres dont la taille ne correspond pas à celle du groupe de l’optimiseur.

source: Aborted.
fr: Abandonné.

source: Currently only {.code x86_64} systems are supported for automatic installation.
fr: L'installation automatique n'existe que pour les systèmes {.code x86_64}.

source: You can manually compile LibTorch for you architecture following instructions in {.url https://github.com/pytorch/pytorch#from-source}
fr: Vous pouvez compiler LibTorch manuellement pour votre architecture en suivant les instructions de {.url https://github.com/pytorch/pytorch#from-source}

source: You can then use {.fn install_torch_from_file} to install manually.
fr: Vous pouvez ensuite utiliser {.fn install_torch_from_file} pour une installation manuelle.

source: Cannot save `name` objects.
fr: Impossible de sauvegarder l'objet de type `name`.

source: Serializing objects with class {.cls {class(obj)}} is only supported with serialization version >= 3, got {.val {use_ser_version()}}
fr: La sérialisation d'objets de classe {.cls {class(obj)}} est possible à partir de la sérialisation en version 3. Ici on a sérialisation en version {.val {use_ser_version()}}

source: Unexpected device {.val NULL}
fr: Périphérique `device` inattendu: {.val NULL}

source: currently unsuported
fr: non disponible pour le moment

source: This version of torch can't load files with serialization version >
fr: Cette version de torch ne peut pas lire des fichiers avec une version de sérialisation >

source: {.arg path} must be a connection or a actual path, got {.cls {class(path)}}.
fr: {.arg path} doit être une connexion ou un chemin existant. Ici, c'est un {.cls {class(path)}}.

source: {.arg path} must be a connection, a raw vector or an actual path, got {.cls {class(path)}}.
fr: {.arg path} doit être une connexion, un vecteur brut, ou un chemin existant. Ici, c'est un {.cls {class(path)}}.

source: ScriptModule does not support non persistent buffers.
fr: Les buffeurs de classe ScriptModules doivent être persistants.

source: Script modules can only register Script modules children.
fr: Les modules de Scripts ne peuvent enregistrer comme fils que d’autre modules de Script.

source: Forward is not defined. Methods from submodules of traced modules are not traced. Are you trying to call from a submodule?
fr: La méthode ‘forward’ n’est pas définie. Les méthodes des sous-modules des modules tracés ne sont pas tracées. Cet appel est-il tenté depuis un sous-module ?

source: Indexing starts at 1 and got a 0.
fr: L’indexation doit démarrer à 1. Actuellement elle est à 0.

source: Had {.arg other} but {.arg device} or {.arg dtype} are non {.val NULL}
fr: {.arg other} est incompatible avec {.arg device} ou {.arg dtype} non {.val NULL}.

source: You must pass a cuda device.
fr: Vous devez fournir un équipement cuda.

source: start indexing starts at 1
fr: ‘start’ doit être indexé à 1

source: Can't set other and dim arguments.
fr: Les arguments ‘dim’ et ‘other’ ne peuvent pas être présents simultanément.

source: The tensor doesn't have names so you can't rename a dimension.
fr: Le tenseur n’a pas de nom, donc vous ne pouvez pas renommer une dimension.

source: Converting integers > .Machine$integer.max is undefined and returns wrong results. Use as.integer64(x)
fr: La conversion d'entier de valeur supérieur à `.Machine$integer.max` n'est pas définie et renvoie des résultats erronés. Veuillez utiliser `as.integer64(x)`

source: You must initialize the nn_module before tracing.
fr: Vous devez initialiser le ‘nn_module’ avant de pouvoir le tracer.

source: jit_trace needs a function or nn_module.
fr: ‘jit_trace’ n’est disponible que pour une fonction ou un ‘nn_module’.

source: Only `script_function` or `script_module` can be saved with `jit_save`.
fr: ‘jit_save’ n’est disponible que pour une ‘script_function’ ou un ‘script_module’.

source: `mod` must be a `nn_module()`.
fr: ‘mod' doit être un `nn_module()`.

source: Arguments passed trough `...` must be named.
fr: Les arguments passés via ‘…’ doivent tous être nommés.

source: Method '{name}' does not exist in `mod` and therefore can't be traced.
fr: La méthode ‘{name}’ n’existe pas dans ‘mod’ et donc ne peut pas être tracée.

source: dtype must be an integer type.
fr: le `dtype` doit être un entier.

source: dtype must be a float type.
fr: le `dtype` doit être un réel (`float`).

source: Can't collate data of class: '{class(data)}'
fr: Impossible de regrouper des données de type '{class(data)}'

source: Can't convert data of class: '{class(data)}'
fr: Impossible de convertir des données de type '{class(data)}'

source: Could not find an object with name '{names(worker_globals)[b]}'.
fr: L’objet nommé '{names(worker_globals)[b]}' est introuvable.

source: Unknown dataset type with class {.cls {class(dataset)}}
fr: Le jeu de donnée de classe {.cls {class(dataset)}} est de type inconnu.

source: Multi-process dataloader not implemented yet for Iterable datasets.
fr: Le dataloader multi-process n'est pas encore disponible pour les jeux de données itérable.

source: Could not create a connection with the main process.
fr: Impossible d'établir la connexion avec le processus principal.

source: Failed starting the worker.
fr: Échec à démarrer le worker.

source: dataloader worker timed out.
fr: Le worker du data-loader a expiré.

source: Error when getting dataset item.
fr: Erreur au moment d'obtenir l'élément dans le jeu de données.

source: Datasets used with parallel dataloader (num_workers > 0) shouldn't have fields containing tensors as they can't be correctly passed to the wroker subprocesses.
fr: Les datasets fournis a un dataloader parallélisé (`num_workers` > 0) ne peuvent pas contenir de tenseurs, parce qu'ils ne peuvent pas être transmis à un sous-process.

source: A field named '{nm}' exists.
fr: Un champ '{nm}' existe déjà.

source: The `enumerate` construct is deprecated in favor of the `coro::loop` syntax.
fr: La fonction `enumerate` est dépréciée et remplacée par `coro::loop`.

source: See https://github.com/mlverse/torch/issues/558 for more information.
fr: Plus d'information dans https://github.com/mlverse/torch/issues/558.

source: Loading the state_dict is only implemented when {.arg .refer_to_state_dict} is {.val TRUE}
fr: Le chargement du `state_dict` n'est possible que quand {.arg .refer_to_state_dict} est {.val TRUE}

source: all tensors must have the same size in the first dimension.
fr: Tous les tenseurs doivent avoir la même taille sur leur première dimension.

source: argument 'out' must be a list of Tensors.
fr: l’argument ‘out’ doit être une liste de tenseurs.

source: expected tuple of
fr: le tuple attendu de

source: elements but got
fr: éléments en contient actuellement

source: argument 'window_length' must be int, not NULL
fr: l’argument 'window_length' doit être un entier, pas un NULL.

source: tensordot expects dims >= 1, but got {dims}
fr: ‘tensordot’ fonctionne avec des dims >=1, actuellement elles sont a {dims}

source: size is set, but one of mean or std is not a scalar value.
fr: La taille est configurée, mais soit `mean`, soit `std` n'est pas une valeur scalaire.

source: options is set, but one of mean or std is not a scalar value.
fr: `options` est configuré, mais soit `mean`, soit `std` n'est pas une valeur scalaire.

source: size is not set.
fr: `size` n'est pas configuré.

source: Please report a bug report in GitHub
fr: Merci de faire remonter un bug dans Github.
